import { Quest } from 'types/quest';

export const quests: Quest[] = [
  {
  id: 1,
  title: 'Склеп',
  description: 'В комнате с приглушённым светом несколько человек, незнакомых друг с другом, приходят в себя. Никто не помнит, что произошло прошлым вечером. Руки и ноги связаным, но одному из вас получилось освободиться. На стене висит пугающий таймер и запущен отстёт 60 минут. Сможете ли вы разобраться в стрессовой ситуации, помочь другим, разобраться что произошло и выбраться из комнаты?',
  previewImg: 'img/preview-sklep.jpg',
  coverImg: 'img/cover-sklep.jpg',
  type: 'horror',
  level: 'hard',
  peopleCount: [2, 5],
  duration: 120
  },
  {
    id: 2,
    title: 'История призраков',
    description: 'пугающий таймер и запущен отстёт 60 минут. Сможете ли вы разобраться в стрессовой ситуации, помочь другим, разобраться что произошло и выбраться из комнаты?',
    previewImg: 'img/preview-sklep.jpg',
    coverImg: 'img/cover-sklep.jpg',
    type: 'horror',
    level: 'hard',
    peopleCount: [2, 5],
    duration: 120
    },
    {
      id: 3,
      title: 'Ритуал',
      description: 'В комнате с приглушённым светом несколько человек, незнакомых друг с другом, приходят в себя. Никто не помнит, что произошло прошлым вечером. Руки и ноги связаным, но одному из вас получилось освободиться. На стене висит пугающий таймер и запущен отстёт 60 минут. Сможете ли вы разобраться в стрессовой ситуации, помочь другим, разобраться что произошло и выбраться из комнаты?',
      previewImg: 'img/preview-sklep.jpg',
      coverImg: 'img/cover-sklep.jpg',
      type: 'adventure',
      level: 'easy',
      peopleCount: [2, 5],
      duration: 120
    },
    {
      id: 4,
      title: 'Маньяк',
      description: 'В комнате с приглушённым светом несколько человек, незнакомых друг с другом, приходят в себя. Никто не помнит, что произошло прошлым вечером. Руки и ноги связаным, но одному из вас получилось освободиться. На стене висит пугающий таймер и запущен отстёт 60 минут. Сможете ли вы разобраться в стрессовой ситуации, помочь другим, разобраться что произошло и выбраться из комнаты?',
      previewImg: 'img/preview-sklep.jpg',
      coverImg: 'img/cover-sklep.jpg',
      type: 'sci-fi',
      level: 'hard',
      peopleCount: [2, 5],
      duration: 120
      },
];
